package com.thinkido.framework.game.utils
{
	/**
	 * 游戏随机名工具 
	 * @author Administrator
	 * 
	 */	
	public class NameUtil
	{
		
		public static const Man:int = 0;
		public static const Woman:int = 1;
		private static var firstNames:Array = ["司马", "欧阳", "端木", "上官", "独孤", "夏侯", "尉迟", "赫连", "皇甫", "公孙", "慕容", "长孙", "宇文", "司徒", "轩辕", "百里", "呼延", "令狐", "诸葛", "南宫", "东方", "西门", "李", "王", "张", "刘", "陈", "杨", "赵", "黄", "周", "胡", "林", "梁", "宋", "郑", "唐", "冯", "董", "程", "曹", "袁", "许", "沈", "曾", "彭", "吕", "蒋", "蔡", "魏", "叶", "杜", "夏", "汪", "田", "方", "石", "熊", "白", "秦", "江", "孟", "龙", "万", "段", "雷", "武", "乔", "洪", "鲁", "葛", "柳", "岳", "梅", "辛", "耿", "关", "苗", "童", "项", "裴", "鲍", "霍", "甘", "景", "包", "柯", "阮", "华", "滕", "穆", "燕", "敖", "冷", "卓", "花", "蓝", "楚", "荆"];
		private static var secondMan0:Array = ["峰", "不", "近", "千", "万", "百", "亿", "一", "求", "笑", "双", "凌", "伯", "仲", "叔", "震", "飞", "晓", "昌", "霸", "冲", "志", "留", "九", "子", "立", "小", "云", "文", "安", "博", "才", "光", "弘", "华", "清", "灿", "俊", "凯", "乐", "良", "明", "健", "辉", "天", "星", "永", "英", "真", "修", "义", "嘉", "成", "傲", "欣", "逸", "飘", "凌", "青", "火", "森", "杰", "思", "智", "辰", "元", "夕", "苍", "劲", "巨", "潇", "邪", "尘"];
		private static var secondMan1:Array = ["败", "悔", "南", "宝", "仞", "刀", "斐", "德", "云", "天", "仁", "岳", "宵", "忌", "爵", "权", "敏", "阳", "狂", "冠", "康", "平", "强", "凡", "邦", "福", "歌", "国", "和", "康", "澜", "民", "宁", "然", "顺", "翔", "晏", "宜", "易", "志", "雄", "佑", "斌", "河", "元", "墨", "松", "林", "之", "翔", "竹", "宇", "轩", "荣", "哲", "风", "霜", "山", "炎", "罡", "盛", "睿", "达", "洪", "武", "耀", "磊", "寒", "冰", "潇", "痕", "空"];
		private static var secondWoman0:Array = ["思", "冰", "夜", "痴", "依", "小", "香", "绿", "映", "含", "曼", "春", "醉", "之", "新", "雨", "天", "如", "若", "涵", "亦", "采", "冬", "安", "芷", "绮", "雅", "飞", "又", "寒", "忆", "晓", "乐", "笑", "妙", "元", "碧", "翠", "初", "怀", "幻", "慕", "秋", "语", "觅", "幼", "灵", "傲", "冷", "沛", "念", "水", "紫", "惜", "诗", "青", "雁", "盼", "尔", "以", "雪", "夏", "凝", "丹", "迎", "宛", "梦", "怜", "听", "巧", "静", "采", "凌", "芊", "琪"];
		private static var secondWoman1:Array = ["烟", "琴", "蓝", "梦", "丹", "柳", "萍", "寒", "霜", "白", "丝", "真", "露", "云", "芙", "容", "香", "荷", "风", "儿", "雪", "巧", "蕾", "芹", "灵", "卉", "夏", "岚", "蓉", "萱", "珍", "彤", "蕊", "曼", "兰", "晴", "珊", "青", "春", "玉", "瑶", "文", "双", "竹", "凝", "桃", "菡", "绿", "梅", "旋", "之", "蝶", "莲", "薇", "翠", "槐", "秋", "雁", "夜", "芊", "冬", "菲", "琪"];
		
		/*var surNameStr:String="赵 钱 孙 李 周 吴 郑 王 冯 陈 褚 卫 蒋 沈 韩 杨 朱 秦 尤 许 何 吕 施 张 孔 曹 严 华 金 魏 陶 姜 戚 谢 邹 喻 柏 水 窦 章 云 苏 潘 葛 奚 范 彭 郎 鲁 韦 昌 马 苗 凤 花 方 俞 任 袁 柳 鲍 史 唐 费 廉 岑 薛 雷 贺 倪 汤 滕 殷 罗 毕 郝 邬 安 常 乐 于 时 傅 皮 卞 齐 康 伍 余 元 卜 顾 孟 平 黄 和 穆 萧 尹 姚 邵 湛 汪 祁 毛 狄 米 贝 明 计 伏 成 戴 谈 宋 茅 庞 熊 纪 舒 屈 项 祝 董 梁 杜 阮 蓝 闵 席 季 麻 强 贾 路 娄 危 江 童 颜 郭 梅 盛 林 刁 钟 徐 邱 骆 高 夏 蔡 田 樊 胡 凌 霍 虞 万 支 柯 管 卢 莫 经 房 裘 缪 干 解 应 宗丁 宣 贲 邓 郁 单 杭 洪 包 诸 左 石 崔 吉 钮 龚 程 嵇 邢 滑 裴 陆 荣 翁 荀 羊 於 惠 甄 曲 家 封 芮 羿 储 汲 邴 松 井 段 富 巫 乌 焦 巴 弓 牧 隗 山 谷 车 侯 宓 蓬 全 郗 班 仰 秋 仲 伊 宫 宁 仇 栾 暴 甘 钭 厉 戎 祖 武 符 刘 景 詹 束 龙 叶 幸 司 韶 郜 黎 蓟 薄 印 宿 白 怀 蒲 台 丛 鄂 索 咸 籍 卓 屠 蒙 池 乔 阴 佟 能 苍 双 闻 莘 党 翟 谭 贡 劳 逄 姬 申 扶 堵 冉 宰 郦 雍 却 璩 桑 桂 牛 寿 通 边 扈 燕 冀 郏 浦 尚 农 温 别 庄 晏 柴 瞿 阎 充 慕 连 茹 习 宦 艾 鱼 容 向 古 易 慎 戈 廖 庚 终 暨 居 衡 步 都 耿 满 弘 匡 国 文 寇 广 禄 阙 东 殴 殳 沃 利 蔚 越 隆 师 巩 厍 聂 勾 敖 融 冷 訾 辛 阚 那 简 饶 空 曾 沙 养 鞠 须 丰 关 蒯 相 查 后 荆 红 游 竺 盖 益 桓 公 万 俟 司马 上官 欧阳 夏侯 诸葛 闻人 东方 赫连 皇甫 尉迟 公羊 澹台 公冶 宗政 濮阳 淳于 单于 太叔 申屠 公孙 仲孙 轩辕 令狐 钟离 宇文 长孙 慕容 鲜于 闾丘 司徒 司空 司寇 子车 颛孙 端木 巫马 乐正 壤驷 公良 拓跋 夹谷 宰父 谷梁 晋 楚 闫 法 汝 涂 干 百里 东郭 南门 呼延 归海 羊舌 微生 岳 帅 况 有 琴 梁丘 左丘 东门 西门 商 牟 伯 赏 南宫 墨 年 阳";
		var manNameStr:String="如生 傲秋 颖洛 川雅 佑吟 敏原 让庭 沙秀 与雁 昭宁 郎清 千佑 秋言 秋语 阳依 明秋 敏知 晓让 知颜 知秋 绿缘 翩飞 醒沙 紫原 问言 青画 晓来 傲楼 雨恨 南心 南夏 羡楠 楚亭 袭渔 元蓝 守蓝 舒羽 献宁 叔颖 浩林 千洛 川沐 川铭 川林 川柏 沐枫 默昀 默野 均彦 圣杭 凌司 血岩 雪涯 智杭 知枫 连勒 君勒 元照 上尘 天随 景淮 骆亚 哲恺 学宇 尔南 楚樵 昭奇 修淮 傲晓 慕亚 宇儒 慕萧 问野 小符 天许 孝弈 东怀 印风 澈宇 逸凡 腾浩 佳聪 剑峰";
		var womanNameStr:String="晓献 索萦 芷月 栩栩 紫与 紫语 临韵 紫洛 千习 青寻 恋双 沁雨 临嫣 桐娅 羡冰 涵若 敏依 嫣泺 晴嫣 烟若 以萌 让羽 素苑 晗秀 飘舞 晓茶 小柠 采桑 弄巧 离莹 诗敏 紫柳 小荷 琉璃 笙絮 画柳 琐涵 瑶雨 雪婵 歌晓 浅潆 醒薇 漱儿 心庭 楚宜 晓怀 雅馨 雯倩 梦雨 琬莠 妙菱 蓉亭 楠蝶 珊胭 婕胭 淑谨 妙妗 淑蕊 可蕊 韵婷 诗晴 欣怡 婉莹 思琪 心妍 念凝 秋晴 涵柔 思双 从云 涵蕾 晓芸 谷蕊 曼凡";
		
		if(gender == 1){
			index2 = int(Math.random() * manName.length);
			roleName.text = surName[index1] + manName[index2];
		}else{
			index2 = int(Math.random() * womanName.length);
			roleName.text = surName[index1] + womanName[index2];
		}
		*/
		public function NameUtil()
		{
		}
		/**
		 * 获取一个随即名 
		 * @param sex 指定性别
		 * @return 姓名
		 * 
		 */		
		public static function getName(sex:int) : String
		{
			var _firstName:String = firstNames[random(0, (firstNames.length - 1))];
			var _name:String = "";
			var _nameLen:int = random(1, 10000000) % 8;
			if (sex == Man)
			{
				if (_nameLen == 1)
				{
					_name = _name + secondMan0[random(0, (secondMan0.length - 1))];
				}
				else if (_nameLen == 2)
				{
					_name = _name + secondMan1[random(0, (secondMan1.length - 1))];
				}
				else
				{
					_name = _name + secondMan0[random(0, (secondMan0.length - 1))];
					_name = _name + secondMan1[random(0, (secondMan1.length - 1))];
				}
			}
			else if (_nameLen == 1)
			{
				_name = _name + secondWoman0[random(0, (secondWoman0.length - 1))];
			}
			else if (_nameLen == 2)
			{
				_name = _name + secondWoman1[random(0, (secondWoman1.length - 1))];
			}
			else
			{
				_name = _name + secondWoman0[random(0, (secondWoman0.length - 1))];
				_name = _name + secondWoman1[random(0, (secondWoman1.length - 1))];
			}
			return _firstName + _name;
		}
		/**
		 * 获取 begin 于 end 之间的随机数
		 * @param begin
		 * @param end
		 * @return 
		 * 
		 */		
		public static function random(begin:int, end:int) : int
		{
			var _temp:int = end - begin;
			return Math.round(Math.random() * _temp) + begin;
		}
		
		
	}
	
}